// 1. დაბეჭდეთ რიცხვები 10-დან 100-მდე 10-ის ნაბიჯით.
for (let i = 10; i <= 100; i += 10) {
  console.log(i);
}

// 2. დაბეჭდეთ ლუწი რიცხვები 10-დან 200-მდე.
for (let i = 10; i <= 200; i += 2) {
  console.log(i);
}

// 3. იპოვეთ რიცხვების ჯამი 10-დან 500-მდე.
let sum = 0;
for (let i = 10; i <= 500; i += 10) {
  sum += i;
}
console.log("ჯამი 10-დან 500-მდე: " + sum);

// 4. შექმენით 10-ის გამრავლების ცხრილი.
const number = 10;
for (let i = 1; i <= 10; i++) {
  console.log(`${number} x ${i} = ${number * i}`);
}
